In [1]:
import os
os.getcwd()

'C:\\Users\\abusa\\ML_Learning\\Pandas'

In [2]:
os.chdir('C:\\Users\\abusa\\ML_Learning')

In [3]:
os.getcwd()

'C:\\Users\\abusa\\ML_Learning'

In [4]:
import pandas as pd
df = pd.read_csv('train.csv')

In [5]:
df.head()

   Id    height    weight
0   1  70.49366  129.3840
1   2  65.23482  104.5786
2   3  67.59619  131.7669
3   4  68.51919  135.0276
4   5  67.07600  118.4065

In [6]:
wd = {
    'day': ['1/1/2017','1/2/2017','1/3/2017','1/4/2017','1/5/2017','1/6/2017'],
    'temperature': [32,35,28,24,32,31],
    'windspeed': [6,7,2,7,4,2],
    'event': ['Rain', 'Sunny', 'Snow','Snow','Rain', 'Sunny']
}

# dictionary to dataframe

In [7]:
wd

{'day': ['1/1/2017',
  '1/2/2017',
  '1/3/2017',
  '1/4/2017',
  '1/5/2017',
  '1/6/2017'],
 'temperature': [32, 35, 28, 24, 32, 31],
 'windspeed': [6, 7, 2, 7, 4, 2],
 'event': ['Rain', 'Sunny', 'Snow', 'Snow', 'Rain', 'Sunny']}

In [8]:
df2 = pd.DataFrame(wd)

In [9]:
df2

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [10]:
df2[2:5] #2 theke 5 er age porjonto

        day  temperature  windspeed event
2  1/3/2017           28          2  Snow
3  1/4/2017           24          7  Snow
4  1/5/2017           32          4  Rain

In [11]:
df2.columns

Index(['day', 'temperature', 'windspeed', 'event'], dtype='object')

In [12]:
df2.day # if we want to see one column

0    1/1/2017
1    1/2/2017
2    1/3/2017
3    1/4/2017
4    1/5/2017
5    1/6/2017
Name: day, dtype: object

In [13]:
df2['event']

0     Rain
1    Sunny
2     Snow
3     Snow
4     Rain
5    Sunny
Name: event, dtype: object

In [14]:
type(df2['event']) #type of data frame columns

pandas.core.series.Series

In [15]:
df2[['event','day']] #if we want to see two columns [event] &[day] in data frame

   event       day
0   Rain  1/1/2017
1  Sunny  1/2/2017
2   Snow  1/3/2017
3   Snow  1/4/2017
4   Rain  1/5/2017
5  Sunny  1/6/2017

In [16]:
df2['day'].max()

'1/6/2017'

In [17]:
df2['temperature']

0    32
1    35
2    28
3    24
4    32
5    31
Name: temperature, dtype: int64

In [18]:
df2['temperature'].min()

24

In [19]:
df2.describe()

       temperature  windspeed
count     6.000000   6.000000
mean     30.333333   4.666667
std       3.829708   2.338090
min      24.000000   2.000000
25%      28.750000   2.500000
50%      31.500000   5.000000
75%      32.000000   6.750000
max      35.000000   7.000000

conditional use of dt_frame

In [20]:
df2[df2.temperature>=32]

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
4  1/5/2017           32          4   Rain

In [21]:
df2[df2.temperature ==df2.temperature.max()] #max temperature

        day  temperature  windspeed  event
1  1/2/2017           35          7  Sunny

In [22]:
df2['day'][df2.temperature ==df2.temperature.max()] #days of max temperature

1    1/2/2017
Name: day, dtype: object

In [23]:
df2[['day','temperature']][df2.temperature ==df2.temperature.max()] #days and temp of max temperature

        day  temperature
1  1/2/2017           35

In [24]:
#[] use when columns name are space

In [25]:
df2

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [26]:
df2.index #int index

RangeIndex(start=0, stop=6, step=1)

In [27]:
df2.set_index('day',inplace=True) #set day as index

In [28]:
df2

          temperature  windspeed  event
day
1/1/2017           32          6   Rain
1/2/2017           35          7  Sunny
1/3/2017           28          2   Snow
1/4/2017           24          7   Snow
1/5/2017           32          4   Rain
1/6/2017           31          2  Sunny

In [29]:
df2.loc['1/1/2017']

temperature      32
windspeed         6
event          Rain
Name: 1/1/2017, dtype: object

In [30]:
df2.set_index('event',inplace=True) #set even as index

In [31]:
df2

       temperature  windspeed
event
Rain            32          6
Sunny           35          7
Snow            28          2
Snow            24          7
Rain            32          4
Sunny           31          2

In [32]:
df2.loc['Rain']

       temperature  windspeed
event
Rain            32          6
Rain            32          4

In [33]:
df2.reset_index(inplace=True) #reset dataframe

In [34]:
df2

   event  temperature  windspeed
0   Rain           32          6
1  Sunny           35          7
2   Snow           28          2
3   Snow           24          7
4   Rain           32          4
5  Sunny           31          2

In [36]:
df.head()

   Id    height    weight
0   1  70.49366  129.3840
1   2  65.23482  104.5786
2   3  67.59619  131.7669
3   4  68.51919  135.0276
4   5  67.07600  118.4065

In [37]:
df.describe()

                 Id        height        weight
count  20000.000000  20000.000000  20000.000000
mean   10000.500000     67.995227    127.097314
std     5773.647028      1.898964     11.657876
min        1.000000     60.612650     78.014760
25%     5000.750000     66.708220    119.333950
50%    10000.500000     67.998055    127.159050
75%    15000.250000     69.264955    134.873125
max    20000.000000     75.152800    170.547900

# data frame create using tuple list

In [38]:
d3 = [
    ('1/1/2017',32,6,'Rain'),
    ('1/2/2017',35,7,'Sunny'),
    ('1/3/2017',28,2,'Snow')
]

In [39]:
d3

[('1/1/2017', 32, 6, 'Rain'),
 ('1/2/2017', 35, 7, 'Sunny'),
 ('1/3/2017', 28, 2, 'Snow')]

In [40]:
df3 = pd.DataFrame(d3, columns=['Day','Temperature','Windspeed','Evengt'])

In [41]:
df3

        Day  Temperature  Windspeed Evengt
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow

import 20 rows from large dataframe

In [47]:
df = pd.read_csv('train.csv',nrows =20 )

In [48]:
df.shape

(20, 3)

In [49]:
df = pd.read_csv('train.csv')

In [54]:
df.isnull()

          Id  height  weight
0      False   False   False
1      False   False   False
2      False   False   False
3      False   False   False
4      False   False   False
...      ...     ...     ...
19995  False   False   False
19996  False   False   False
19997  False   False   False
19998  False   False   False
19999  False   False   False

[20000 rows x 3 columns]

# Handle missing Value

In [94]:
os.chdir('C:\\Users\\abusa\\ML_Learning\\Pandas')

os.getcwd()

'C:\\Users\\abusa\\ML_Learning\\pandas'

In [95]:
df = pd.read_csv('weather_data .csv')

In [96]:
df

         day  temperature  winspeed   event
0   1/1/2017         32.0       6.0    Rain
1   1/4/2017          NaN       9.0   Sunny
2   1/5/2017         28.0       NaN    Snow
3   1/6/2017          NaN       NaN     NaN
4   1/7/2017         32.0       7.0    Rain
5   1/8/2017          NaN       NaN   Sunny
6   1/9/2017          NaN       NaN     NaN
7  1/10/2017         34.0       8.0  Cloudy
8  1/11/2017         40.0      12.0   Sunny

In [97]:
type(df.day[0])

str

In [98]:
df = pd.read_csv('weather_data .csv', parse_dates=['day'])
df

         day  temperature  winspeed   event
0 2017-01-01         32.0       6.0    Rain
1 2017-01-04          NaN       9.0   Sunny
2 2017-01-05         28.0       NaN    Snow
3 2017-01-06          NaN       NaN     NaN
4 2017-01-07         32.0       7.0    Rain
5 2017-01-08          NaN       NaN   Sunny
6 2017-01-09          NaN       NaN     NaN
7 2017-01-10         34.0       8.0  Cloudy
8 2017-01-11         40.0      12.0   Sunny

In [99]:
type(df.day[0]) #

pandas._libs.tslibs.timestamps.Timestamp

In [100]:
df.set_index('day',inplace=True)

In [101]:
print(df)

            temperature  winspeed   event
day
2017-01-01         32.0       6.0    Rain
2017-01-04          NaN       9.0   Sunny
2017-01-05         28.0       NaN    Snow
2017-01-06          NaN       NaN     NaN
2017-01-07         32.0       7.0    Rain
2017-01-08          NaN       NaN   Sunny
2017-01-09          NaN       NaN     NaN
2017-01-10         34.0       8.0  Cloudy
2017-01-11         40.0      12.0   Sunny

In [102]:
df

            temperature  winspeed   event
day
2017-01-01         32.0       6.0    Rain
2017-01-04          NaN       9.0   Sunny
2017-01-05         28.0       NaN    Snow
2017-01-06          NaN       NaN     NaN
2017-01-07         32.0       7.0    Rain
2017-01-08          NaN       NaN   Sunny
2017-01-09          NaN       NaN     NaN
2017-01-10         34.0       8.0  Cloudy
2017-01-11         40.0      12.0   Sunny

In [103]:
new_df = df.fillna(0) #replace missing value with 0
new_df

            temperature  winspeed   event
day
2017-01-01         32.0       6.0    Rain
2017-01-04          0.0       9.0   Sunny
2017-01-05         28.0       0.0    Snow
2017-01-06          0.0       0.0       0
2017-01-07         32.0       7.0    Rain
2017-01-08          0.0       0.0   Sunny
2017-01-09          0.0       0.0       0
2017-01-10         34.0       8.0  Cloudy
2017-01-11         40.0      12.0   Sunny

In [104]:
new_df = df.fillna({
    
    'temperature': 0,
    'winspeed': 0,
    'event':'no event'
})
new_df

            temperature  winspeed     event
day
2017-01-01         32.0       6.0      Rain
2017-01-04          0.0       9.0     Sunny
2017-01-05         28.0       0.0      Snow
2017-01-06          0.0       0.0  no event
2017-01-07         32.0       7.0      Rain
2017-01-08          0.0       0.0     Sunny
2017-01-09          0.0       0.0  no event
2017-01-10         34.0       8.0    Cloudy
2017-01-11         40.0      12.0     Sunny

In [105]:
new_df = df.fillna(method="ffill")#forward value fill in the messing value
new_df

            temperature  winspeed   event
day
2017-01-01         32.0       6.0    Rain
2017-01-04         32.0       9.0   Sunny
2017-01-05         28.0       9.0    Snow
2017-01-06         28.0       9.0    Snow
2017-01-07         32.0       7.0    Rain
2017-01-08         32.0       7.0   Sunny
2017-01-09         32.0       7.0   Sunny
2017-01-10         34.0       8.0  Cloudy
2017-01-11         40.0      12.0   Sunny

In [106]:
new_df = df.fillna(method="bfill")#back value fill in the messing value
new_df

            temperature  winspeed   event
day
2017-01-01         32.0       6.0    Rain
2017-01-04         28.0       9.0   Sunny
2017-01-05         28.0       7.0    Snow
2017-01-06         32.0       7.0    Rain
2017-01-07         32.0       7.0    Rain
2017-01-08         34.0       8.0   Sunny
2017-01-09         34.0       8.0  Cloudy
2017-01-10         34.0       8.0  Cloudy
2017-01-11         40.0      12.0   Sunny

In [108]:
new_df = df.fillna(method="ffill",limit =1)#one time copy value
new_df

            temperature  winspeed   event
day
2017-01-01         32.0       6.0    Rain
2017-01-04         32.0       9.0   Sunny
2017-01-05         28.0       9.0    Snow
2017-01-06         28.0       NaN    Snow
2017-01-07         32.0       7.0    Rain
2017-01-08         32.0       7.0   Sunny
2017-01-09          NaN       NaN   Sunny
2017-01-10         34.0       8.0  Cloudy
2017-01-11         40.0      12.0   Sunny

In [109]:
new_df = df.interpolate()#fill massing value between guess(linear interpolate)
new_df

            temperature   winspeed   event
day
2017-01-01    32.000000   6.000000    Rain
2017-01-04    30.000000   9.000000   Sunny
2017-01-05    28.000000   8.333333    Snow
2017-01-06    30.000000   7.666667     NaN
2017-01-07    32.000000   7.000000    Rain
2017-01-08    32.666667   7.333333   Sunny
2017-01-09    33.333333   7.666667     NaN
2017-01-10    34.000000   8.000000  Cloudy
2017-01-11    40.000000  12.000000   Sunny

In [106]:
new_df = df.fillna(method="bfill")#back value fill in the messing value
new_df

            temperature  winspeed   event
day
2017-01-01         32.0       6.0    Rain
2017-01-04         28.0       9.0   Sunny
2017-01-05         28.0       7.0    Snow
2017-01-06         32.0       7.0    Rain
2017-01-07         32.0       7.0    Rain
2017-01-08         34.0       8.0   Sunny
2017-01-09         34.0       8.0  Cloudy
2017-01-10         34.0       8.0  Cloudy
2017-01-11         40.0      12.0   Sunny

In [111]:
new_df = df.interpolate(method="time")#value fill with time
new_df

            temperature   winspeed   event
day
2017-01-01    32.000000   6.000000    Rain
2017-01-04    29.000000   9.000000   Sunny
2017-01-05    28.000000   8.333333    Snow
2017-01-06    30.000000   7.666667     NaN
2017-01-07    32.000000   7.000000    Rain
2017-01-08    32.666667   7.333333   Sunny
2017-01-09    33.333333   7.666667     NaN
2017-01-10    34.000000   8.000000  Cloudy
2017-01-11    40.000000  12.000000   Sunny

In [112]:
new_df = df.dropna()#missing value is dropped
new_df

            temperature  winspeed   event
day
2017-01-01         32.0       6.0    Rain
2017-01-07         32.0       7.0    Rain
2017-01-10         34.0       8.0  Cloudy
2017-01-11         40.0      12.0   Sunny

In [113]:
new_df = df.dropna(how='all')#if all missing value,it is dropped
new_df

            temperature  winspeed   event
day
2017-01-01         32.0       6.0    Rain
2017-01-04          NaN       9.0   Sunny
2017-01-05         28.0       NaN    Snow
2017-01-07         32.0       7.0    Rain
2017-01-08          NaN       NaN   Sunny
2017-01-10         34.0       8.0  Cloudy
2017-01-11         40.0      12.0   Sunny

In [115]:
new_df = df.dropna(thresh=2)#it take 2 valid value

            temperature  winspeed   event
day
2017-01-01         32.0       6.0    Rain
2017-01-04          NaN       9.0   Sunny
2017-01-05         28.0       NaN    Snow
2017-01-07         32.0       7.0    Rain
2017-01-10         34.0       8.0  Cloudy
2017-01-11         40.0      12.0   Sunny

In [114]:
new_df = df.dropna(thresh=1)#1 missing value is exist, and all colums missing are dropped
new_df

            temperature  winspeed   event
day
2017-01-01         32.0       6.0    Rain
2017-01-04          NaN       9.0   Sunny
2017-01-05         28.0       NaN    Snow
2017-01-07         32.0       7.0    Rain
2017-01-08          NaN       NaN   Sunny
2017-01-10         34.0       8.0  Cloudy
2017-01-11         40.0      12.0   Sunny